src/app/controllers/application_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 5 LIMIT 1
---
  def current_user
    return unless session[:user_id]
    @current_user = User.find_by(id: session[:user_id])