src/app/controllers/boards_controller.rb

SELECT `boards`.* FROM `boards`
INSERT INTO `boards` (`name`, `title`, `body`, `created_at`, `updated_at`) VALUES ('das', 'dainote', 'dainote', '2022-02-28 23:43:45.115365', '2022-02-28 23:43:45.115365')
---
  def index
    #タグ検索
    @q = Board.ransack(params[:q])
    if params[:tag_id].present?
    #タグ検索の処理
    @boards = params[:tag_id].present? ? Tag.find(params[:tag_id]).boards : Board.all
    @boards = @boards.page(params[:page]).per(8)
    else
    #キーワード検索
    @boards = @q.result(distinct: true).page(params[:page]).per(8)
    .all.order(id: "DESC")
    end

    @boards_count = Board.all.count
    #掲示板の合計数
    @today_count = Board.created_today.count

INSERT INTO `boards` (`name`, `title`, `body`, `created_at`, `updated_at`) VALUES ('das', 'dainote', 'dainote', '2022-02-28 23:43:45.115365', '2022-02-28 23:43:45.115365')
---
  def create
    @user = current_user
    # board = Board.new(board_params)
    board = @user.boards.build(board_params)
    #userを紐付け
    board.image.attach(params[:board][:image])