src/app/app/controllers/boards_controller.rb

SELECT `boards`.* FROM `boards`
INSERT INTO `boards` (`name`, `title`, `body`, `created_at`, `updated_at`) VALUES ('das', 'dainote', 'dainote', '2022-02-28 23:43:45.115365', '2022-02-28 23:43:45.115365')
---
  def index
    @boards = params[:tag_id].present? ? Tag.find(params[:tag_id]).boards : Board.all.order(id: "DESC")
    @boards = @boards.page(params[:page])
    @boards_count = Board.all.count
    @today_count = Board.created_today.count
    @lastmonth_count = Board.created_last_month.count
    @month_count = Board.created_month.count

INSERT INTO `boards` (`name`, `title`, `body`, `created_at`, `updated_at`) VALUES ('das', 'dainote', 'dainote', '2022-02-28 23:43:45.115365', '2022-02-28 23:43:45.115365')
---
  def create
    board = Board.new(board_params)
    board.image.attach(params[:board][:image])